app/Views/user/animeInfo.php

SELECT *
FROM `user_favorites`
WHERE `user_id` = '2'
AND `anime_id` = '4'
 LIMIT 1
---
                        <?php if(session()->get('isLoggedIn')): ?>
                            <?php
                                $favModel = new \App\Models\UserFavoriteModel();
                                $isFav = $favModel->where(['user_id' => session()->get('id'), 'anime_id' => $anime['anime_id']])->first();