app/Controllers/adminController.php

SELECT *
FROM `animes`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `animes`
---
	public function dashboard()
	{
        $db = \Config\Database::connect();

        $threshold = date('Y-m-d H:i:s', strtotime('-5 minutes'));

        $perPage = 20; // Jumlah item per halaman

        // Ambil data anime dengan paginasi
        $currentPage = $this->request->getVar('page_animes') ? (int)$this->request->getVar('page_animes') : 1;

        // Mengambil data anime dengan paginasi
        $daftarAnime = $this->animeModel->paginate($perPage, 'animes', $currentPage);

SELECT COUNT(*) AS `numrows`
FROM `animes`
WHERE DATE(created_at) = '2026-06-01'
SELECT COUNT(*) AS `numrows`
FROM `user_recent_anime`
WHERE DATE(created_at) = '2026-06-01'
---
            $chartLabels[] = $displayDate;

            // 3. Query Jumlah Anime Ditambahkan pada hari tersebut
            $animeCount = $db->table('animes')
                             ->where('DATE(created_at)', $dateQuery)
                             ->countAllResults();
            $dataAnime[] = $animeCount;

            // 4. Query Trafik Pengunjung (Menggunakan histori user menonton sebagai representasi)
            $visitorCount = $db->table('user_recent_anime')
                               ->where('DATE(created_at)', $dateQuery)
                               ->countAllResults();

SELECT `a`.`Judul`, SUM(ev.view_count) as total_views
FROM `animes` `a`
LEFT JOIN `episodeanime` `ea` ON `ea`.`anime_id` = `a`.`id`
LEFT JOIN `episode_views` `ev` ON `ev`.`episode_id` = `ea`.`id`
GROUP BY `a`.`id`
ORDER BY `total_views` DESC
 LIMIT 5
---

                        // --- QUERY TOP 5 ANIME BERDASARKAN VIEWS ---
            // Join tabel animes -> episodeanime -> episode_views
            $topAnimeQuery = $db->table('animes a')
            ->select('a.Judul, SUM(ev.view_count) as total_views')
            ->join('episodeanime ea', 'ea.anime_id = a.id', 'left')
            ->join('episode_views ev', 'ev.episode_id = ea.id', 'left')
            ->groupBy('a.id')
            ->orderBy('total_views', 'DESC')
            ->limit(5) // Ambil 5 teratas
            ->get()
            ->getResultArray();

SELECT `g`.`genre`, COUNT(ag.anime_id) as total_anime
FROM `genre` `g`
LEFT JOIN `animegenre` `ag` ON `ag`.`genre_id` = `g`.`id`
GROUP BY `g`.`id`
ORDER BY `total_anime` DESC
 LIMIT 5
---

                // --- QUERY STATISTIK GENRE (TOP 5 GENRE) ---
        // Join tabel genre dan animegenre untuk menghitung jumlah anime per genre
        $genreQuery = $db->table('genre g')
            ->select('g.genre, COUNT(ag.anime_id) as total_anime')
            ->join('animegenre ag', 'ag.genre_id = g.id', 'left')
            ->groupBy('g.id')
            ->orderBy('total_anime', 'DESC')
            ->limit(5) // Ambil 5 genre terbanyak
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `animes`
WHERE `status` = 'Completed'
SELECT COUNT(*) AS `numrows`
FROM `animes`
WHERE `status` = 'On-Going'
SELECT COUNT(*) AS `numrows`
FROM `user_level`
WHERE `level` = 'Basic'
SELECT COUNT(*) AS `numrows`
FROM `user_level`
WHERE `level` = 'Pro'
---
            $genreCounts[] = $row['total_anime'] ? $row['total_anime'] : 0;
        }

        $completedCount = $db->table('animes')->where('status', 'Completed')->countAllResults();
        $ongoingCount   = $db->table('animes')->where('status', 'On-Going')->countAllResults();

        // --- 2. STATISTIK LEVEL USER ---
        $basicCount = $db->table('user_level')->where('level', 'Basic')->countAllResults();
        $proCount   = $db->table('user_level')->where('level', 'Pro')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `last_activity` >= '2026-06-07 19:17:09'
---
            'pager' => $this->animeModel->pager, // Object pagination
            'totalAnime' => $totalAnime,
            'totalEpisode' => $totalEpisode,
            'totalOnline' =>$this->userModel->where('last_activity >=', $threshold)->countAllResults(),

SELECT *
FROM `animes`
WHERE `Judul` = 'Boku no Hero Academia: More'
 LIMIT 1
---
    public function fetchAnimeData($source = 'seasons/now', $page = 1)
    {
        helper(['anime', 'mapAnimeStatus', 'translation', 'url']);
        $client = \Config\Services::curlrequest();
        $db = \Config\Database::connect();
        $fetched = 0;

        $apiPath = str_replace('-', '/', $source);
        $apiUrl = "https://api.jikan.moe/v4/{$apiPath}?page={$page}&sfw=true";

        try {
            $response = $client->request('GET', $apiUrl, ['http_errors' => false]);
            $data = json_decode($response->getBody(), true);
            $hasNextPage = $data['pagination']['has_next_page'] ?? false;

            if (empty($data['data'])) {
                return $this->response->setJSON(['status' => 'error', 'message' => 'Data tidak ditemukan.']);
            }

            // Batasi jumlah anime per klik agar tidak timeout saat translasi & fetch studio/episode
            $limitData = 5;
            $animesToProcess = array_slice($data['data'], 0, $limitData);

            foreach ($animesToProcess as $anime) {
                // 1. Cek duplikasi anime
                $existingAnime = $this->animeModel->where('Judul', $anime['title'])->first();

INSERT INTO `animes` (`Judul`, `slug`, `Poster`, `BackgroundCover`, `Desc`, `Eps`, `Durasi`, `Rilis`, `JudulLainnya`, `typeId`, `status`, `statusTayang`, `mal_id`, `mal_score`, `source`, `season`, `release_year`) VALUES ('Boku no Hero Academia: More', 'boku-no-hero-academia-more', 'https://cdn.myanimelist.net/images/anime/1273/156615l.webp', 'https://cdn.myanimelist.net/images/anime/1273/156615l.webp', 'Bertahun-tahun setelah perang habis-habisan melawan penjahat dan kelulusan dari Akademi UA, mantan siswa Kelas 1-A telah menemukan panggilan mereka dalam masyarakat. Dengan meningkatnya pendidikan Quirk di seluruh Jepang, Ochako Uraraka memainkan peran penting dalam memastikan generasi baru pengguna Quirk tumbuh dengan baik. Meski puas dengan status quo, Ochako teringat oleh bayangan Himiko Toga akan sesuatu penting yang ia lupakan di tengah pekerjaannya.\n\nSementara itu, Izuku Midoriya adalah yang paling bahagia selama menjadi guru di UA Academy. Namun, saat Midoriya dan Ochako ikut serta dalam pertemuan dengan mantan teman sekelas mereka, mereka berdua menyadari apa yang hilang dalam hidup mereka.\n\n[Ditulis oleh MAL Penulisan Ulang]', 1, 23, '2026-05-02T00:00:00+00:00', '僕のヒーローアカデミア More', 0, 'Completed', 'published', 63130, 8.12, 'Manga', 'Unknown', NULL)
---
                    'created_at'      => date('Y-m-d H:i:s'),
                ];

                $this->animeModel->insert($animeData);

SELECT *
FROM `studios`
WHERE `nama_studio` = 'Bones Film'
INSERT INTO `studios` (`nama_studio`, `slug_studio`) VALUES ('Zexcs', 'zexcs')
---
                        $studioName = $s['name'];
                        $listStudio[] = $studioName; // Masukkan ke array log
                        // Cek di tabel master studio
                        $existingStudio = $db->table('studios')->where('nama_studio', $studioName)->get()->getRowArray();

                        if (!$existingStudio) {
                            $db->table('studios')->insert([
                                'nama_studio' => $studioName,
                                'slug_studio' => url_title($studioName, '-', true)
                            ]);

INSERT INTO `anime_studios` (`anime_id`, `studio_id`) VALUES (52, '5')
---
                        }

                        // Hubungkan ke tabel pivot anime_studios
                        $db->table('anime_studios')->insert([
                            'anime_id'  => $animeInternalId,
                            'studio_id' => $studioId
                        ]);

SELECT *
FROM `genre`
WHERE `genre` = 'Action'
 LIMIT 1
INSERT INTO `genre` (`genre`, `slug_genre`) VALUES ('Performing Arts', 'performing-arts')
---
                if (!empty($allTags)) {
                    foreach ($allTags as $g) {
                        $listGenre[] = $g['name']; // Masukkan ke array log
                        $existingGenre = $this->genreModel->where('genre', $g['name'])->first();
                        if (!$existingGenre) {
                            $this->genreModel->insert([
                                'genre'      => $g['name'],
                                'slug_genre' => url_title($g['name'], '-', true)
                            ]);

INSERT INTO `animeGenre` (`anime_id`, `genre_id`) VALUES (52, '2')
---
                            $genreId = $existingGenre['id'];
                        }

                        $db->table('animeGenre')->insert([
                            'anime_id' => $animeInternalId,
                            'genre_id' => $genreId
                        ]);

INSERT INTO `admin_logs` (`admin_id`, `admin_name`, `action`, `item`, `item_id`, `description`, `change_type`, `created_at`, `updated_at`) VALUES ('2', 'Admin', 'SYNC API', 'Anime Master Jikan API', 52, 'Melakukan Sync data Jikan API untuk anime berjudul: <strong>Boku no Hero Academia: More</strong>', 'Ditarik beserta <strong>0 Eps</strong>, Studio: <strong>Bones Film</strong>, Genre: <strong>Action, School, Super Power, Shounen</strong>', '2026-06-07 19:22:32', '2026-06-07 19:22:32')
---
                $strStudio = !empty($listStudio) ? implode(", ", $listStudio) : 'Unknown';
                $strGenre = !empty($listGenre) ? implode(", ", $listGenre) : 'Unknown';

                $this->adminLogsModel->insert([
                    'admin_id'    => session()->get('id'),
                    'admin_name'  => session()->get('nama'),
                    'action'      => 'SYNC API',
                    'item'        => 'Anime Master Jikan API',
                    'item_id'     => $animeInternalId,
                    'description' => 'Melakukan Sync data Jikan API untuk anime berjudul: <strong>' . $anime['title'] .'</strong>',
                    'change_type' => "Ditarik beserta <strong>$jumlahEps Eps</strong>, Studio: <strong>$strStudio</strong>, Genre: <strong>$strGenre</strong>"
                ]);

INSERT INTO `EpisodeAnime` (`anime_id`, `judul`, `slug-episode`, `episode_number`, `deskripsi`, `GambarPreview`, `video_path`, `created_at`) VALUES (53, 'On That Day', 'episode-1-0c89', 1, 'Episode terbaru dari seri ini.', 'default.png', 'default.mp4', '2026-06-07 19:22:36')
---
    private function autoFetchEpisodes($malId, $animeInternalId)
    {
        sleep(1); // Jeda rate limit

        $client = \Config\Services::curlrequest();
        $epUrl = "https://api.jikan.moe/v4/anime/{$malId}/episodes";
        $jumlahDitarik = 0; // Tambahkan variabel counter

        try {
            $response = $client->request('GET', $epUrl, ['http_errors' => false]);
            $epData = json_decode($response->getBody(), true);

            if (!empty($epData['data'])) {
                $db = \Config\Database::connect();

                foreach ($epData['data'] as $ep) {
                    // 1. Simpan Episode
                    $db->table('EpisodeAnime')->insert([
                        'anime_id'       => $animeInternalId,
                        'judul'          => $ep['title'] ?? 'Episode ' . $ep['mal_id'],
                        'slug-episode'   => 'episode-' . $ep['mal_id'] . '-' . bin2hex(random_bytes(2)),
                        'episode_number' => $ep['mal_id'],
                        'deskripsi'      => 'Episode terbaru dari seri ini.',
                        'GambarPreview'  => 'default.png',
                        'video_path'     => 'default.mp4',
                        'created_at'     => date('Y-m-d H:i:s')
                    ]);

INSERT INTO `episode_views` (`episode_id`, `view_count`, `created_at`, `updated_at`) VALUES (191, 0, '2026-06-07 19:22:36', '2026-06-07 19:22:36')
---
                    $lastEpId = $db->insertID();

                    // 2. Simpan Views Awal (0)
                    $db->table('episode_views')->insert([
                        'episode_id' => $lastEpId,
                        'view_count' => 0, // Database tetap menyimpan angka murni
                        'created_at' => date('Y-m-d H:i:s'),
                        'updated_at' => date('Y-m-d H:i:s')
                    ]);