app/Controllers/Page.php

SELECT *
FROM `genre`
SELECT *
FROM `studios`
---

        $data = [
            'title'      => 'Browse Anime | Wotakus',
            'genres'     => $this->genreModel->findAll(),
            'studios'    => $this->studioModel->findAll(),

SELECT COUNT(*) AS `numrows`
FROM `anime_ratings`
WHERE `anime_id` = '4'
SELECT *
FROM `anime_ratings`
WHERE `user_id` = '2'
AND `anime_id` = '4'
 LIMIT 1
---
    public function AnimesDetail($slug)
    {

        $anime = $this->animeModel->getAnimeWithGenresSlug($slug);

        if (!$anime || $anime['statusTayang'] !== 'published') {
            // Tampilkan pesan error jika anime tidak ditemukan atau statusnya draft
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Anime tidak ditemukan atau belum dipublikasikan.');
        }

            // --- LOGIKA RATING (TAMBAHKAN INI) ---
        $ratingModel = new \App\Models\AnimeRatingModel();
        $averageRating = $ratingModel->getAverageRating($anime['anime_id']);

        $totalVoters = $ratingModel->where('anime_id', $anime['anime_id'])->countAllResults();

        $myRating = 0;
        if (session()->has('id')) {
            $userRating = $ratingModel->where([
                'user_id'  => session()->get('id'),
                'anime_id' => $anime['anime_id']
            ])->first();

SELECT *
FROM `episode_views`
WHERE `episode_id` = '11'
 LIMIT 1
---

        // Dapatkan view_count untuk setiap episode
        foreach ($episode as &$ep) {
            $viewRecord = $this->episodeViews->where('episode_id', $ep['id'])->first();

SELECT *
FROM `user_recent_anime`
WHERE `user_id` = '2'
AND `anime_id` = '4'
 LIMIT 1
INSERT INTO `user_recent_anime` (`user_id`, `anime_id`, `episode_id`, `created_at`, `updated_at`) VALUES ('2', '4', NULL, '2026-06-07 15:14:54', '2026-06-07 15:14:54')
---
            $userId = session()->get('id');

            // Cek jika anime sudah ada di tabel recent_anime tanpa episode
            $existingAnime = $this->userRecentAnimeModel
            ->where('user_id', $userId)
            ->where('anime_id', $id)
            ->first();

            // Jika tidak ada atau episode_id null, tambahkan atau perbarui data recent anime
            if (!$existingAnime) {
            $this->userRecentAnimeModel->insert([
                'user_id' => $userId,
                'anime_id' => $id,
                'episode_id' => null,
            ]);