app/Controllers/Page.php

    public function animesHome()
    {
        $data = [
            'title' => 'Animes | ',
            'animes'=>  $this->animeModel->where('statusTayang', 'published')->paginate(16, 'animes'),
---
SELECT *
FROM `animes`
WHERE `statusTayang` = 'published'
 LIMIT 16
SELECT COUNT(*) AS `numrows`
FROM `animes`
WHERE `statusTayang` = 'published'