app/Models/AnimeRatingModel.php

    public function getAverageRating($animeId)
    {
        $result = $this->where('anime_id', $animeId)->selectAvg('rating')->first();
---
SELECT AVG(`rating`) AS `rating`
FROM `anime_ratings`
WHERE `anime_id` = '4'
 LIMIT 1