app/Models/EpisodeModel.php

SELECT `episodeanime`.*, `animes`.`slug` as `anime_slug`, `episodeanime`.`slug-episode` as `episode_slug`
FROM `episodeanime`
JOIN `animes` ON `episodeanime`.`anime_id` = `animes`.`id`
WHERE `animes`.`slug` = 'js'
AND `episodeanime`.`slug-episode` = 'searchIcon.js'
---
    public function getEpisodeBySlug($animeSlug, $episodeSlug)
    {
        return $this->db->table('episodeanime')
                    ->select('episodeanime.*, animes.slug as anime_slug, episodeanime.slug-episode as episode_slug')
                    ->join('animes', 'episodeanime.anime_id = animes.id')
                    ->where('animes.slug', $animeSlug)
                    ->where('episodeanime.slug-episode', $episodeSlug)
                    ->get()
                    ->getRowArray();

SELECT `episodeanime`.*, `animes`.`Judul` as `Judul`, `animes`.`slug` as `slug`
FROM `episodeanime`
LEFT JOIN `animes` ON `animes`.`id` = `episodeanime`.`anime_id`
ORDER BY `episodeanime`.`created_at` DESC
 LIMIT 15
---
    public function getNewEpisodesWithAnimeTitle($limit = 8)
    {
        return $this->select('episodeanime.*, animes.Judul as Judul, animes.slug as slug')
                    ->join('animes', 'animes.id = episodeanime.anime_id', 'left')
                    ->orderBy('episodeanime.created_at', 'DESC')
                    ->findAll($limit);