app/Models/Genre.php

SELECT *
FROM `genre`
---
    public function getGenre($genre = false)
    {
        if($genre == false){
            return $this->findAll();