app/Models/JjkModel.php

SELECT *, GROUP_CONCAT(genre.id, ":", `genre`.`genre`, ":", genre.slug_genre) AS genre
FROM `animes`
JOIN `AnimeGenre` ON `animes`.`id` = `AnimeGenre`.`anime_id`
JOIN `genre` ON `AnimeGenre`.`genre_id` = `genre`.`id`
JOIN `animetipe` ON `animes`.`typeId` = `animetipe`.`id`
WHERE `animes`.`slug` = 'jujur-kasian'
GROUP BY `animes`.`id`
---
    public function getAnimeWithGenresSlug($slug)
    {
        $builder = $this->db->table('animes');
        $builder->select('*')->select('GROUP_CONCAT(genre.id, ":", genre.genre, ":", genre.slug_genre) AS genre');
        $builder->join('AnimeGenre', 'animes.id = AnimeGenre.anime_id');
        $builder->join('genre', 'AnimeGenre.genre_id = genre.id','genre.slug-genre');
        $builder->join('animetipe', 'animes.typeId = animetipe.id');
        $builder->where('animes.slug', $slug);
        $builder->groupBy('animes.id');

        $query = $builder->get();

SELECT *
FROM `animes`
JOIN `episodeanime` ON `episodeanime`.`anime_id` = `animes`.`id`
WHERE `animes`.`id` = '1'
ORDER BY `episode_number` ASC
---
    public function getEpisode($id)
    {
        return $this->db->table('animes')
                        ->join('episodeanime', 'episodeanime.anime_id = animes.id')
                        ->select('*')
                        ->where('animes.id', $id)
                        ->orderBy('episode_number', 'ASC')
                        ->get()
                        ->getResultArray();

SELECT `animes`.*
FROM `serilainnya`
JOIN `animes` ON `animes`.`id` = `serilainnya`.`seriLainnya_id`
WHERE `serilainnya`.`anime_id` = '1'
---
    public function getRelatedAnime($animeId)
    {
    return $this->db->table('serilainnya')
                    ->select('animes.*')
                    ->join('animes', 'animes.id = serilainnya.seriLainnya_id')
                    ->where('serilainnya.anime_id', $animeId)
                    ->get()
                    ->getResultArray();