app/Models/JjkModel.php

SELECT `animes`.*, `animetipe`.`tipeAnime`
FROM `animes`
LEFT JOIN `animetipe` ON `animetipe`.`id` = `animes`.`typeId`
WHERE `animes`.`id` IN (12,13,18,7,9,10,2,3,17,4,5,31)
---
    public function getPythonRecommendations($userId)
    {
        $client = \Config\Services::curlrequest();

        try {
            // Tembak API Python yang berjalan di localhost:8000
            $response = $client->request('GET', "http://127.0.0.1:8000/api/recommend/{$userId}", [
                'timeout' => 5, // Jangan terlalu lama agar web tidak hang jika Python mati
                'http_errors' => false
            ]);

            $result = json_decode($response->getBody(), true);

            // Jika Python berhasil menghitung rekomendasi
            if (isset($result['status']) && $result['status'] === 'success') {

                // Ambil array data rekomendasinya
                $recommendationData = $result['data'];

                if (empty($recommendationData)) return [];

                // Kumpulkan ID anime hasil rekomendasi
                $animeIds = array_column($recommendationData, 'anime_id');

                // Ambil data lengkap (Poster, Judul, dll) dari database CI4
                $builder = $this->select('animes.*, animetipe.tipeAnime')
                                ->join('animetipe', 'animetipe.id = animes.typeId', 'left')
                                ->whereIn('animes.id', $animeIds);

                $animesFromDb = $builder->findAll();

SELECT `animes`.*, `animetipe`.`tipeAnime`
FROM `animes`
LEFT JOIN `animetipe` ON `animetipe`.`id` = `animes`.`typeId`
WHERE `animes`.`id` IN (3,15,9,10,13,27,25,20,14,2,16,7)
ORDER BY FIELD(animes.id, 3, 15, 9, 10, 13, 27, 25, 20, 14, 2, 16, 7)
---
    public function getPythonSimilarAnimes($animeId)
    {
        $client = \Config\Services::curlrequest();

        try {
            $response = $client->request('GET', "http://127.0.0.1:8000/api/similar/{$animeId}", [
                'timeout' => 5,
                'http_errors' => false
            ]);

            $result = json_decode($response->getBody(), true);

            if (isset($result['status']) && $result['status'] === 'success') {
                $recommendationData = $result['data'];

                if (empty($recommendationData)) return [];

                // Ambil ID
                $animeIds = array_column($recommendationData, 'anime_id');

                // Ambil data lengkap dari DB
                // Gunakan FIELD() di ORDER BY agar urutan dari Python (skor tertinggi) tidak berantakan saat diambil dari DB
                $idString = implode(',', $animeIds);
                $builder = $this->select('animes.*, animetipe.tipeAnime')
                                ->join('animetipe', 'animetipe.id = animes.typeId', 'left')
                                ->whereIn('animes.id', $animeIds)
                                ->orderBy("FIELD(animes.id, $idString)");

                $animesFromDb = $builder->findAll();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `animes`.*, `animetipe`.`tipeAnime`, GROUP_CONCAT(DISTINCT studios.nama_studio SEPARATOR ", ") as all_studios
FROM `animes`
LEFT JOIN `animetipe` ON `animes`.`typeId` = `animetipe`.`id`
LEFT JOIN `anime_studios` ON `animes`.`id` = `anime_studios`.`anime_id`
LEFT JOIN `studios` ON `anime_studios`.`studio_id` = `studios`.`id`
WHERE `animes`.`statusTayang` = 'published'
GROUP BY `animes`.`id`
) CI_count_all_results
SELECT `animes`.*, `animetipe`.`tipeAnime`, GROUP_CONCAT(DISTINCT studios.nama_studio SEPARATOR ", ") as all_studios
FROM `animes`
LEFT JOIN `animetipe` ON `animes`.`typeId` = `animetipe`.`id`
LEFT JOIN `anime_studios` ON `animes`.`id` = `anime_studios`.`anime_id`
LEFT JOIN `studios` ON `anime_studios`.`studio_id` = `studios`.`id`
WHERE `animes`.`statusTayang` = 'published'
GROUP BY `animes`.`id`
 LIMIT 18
---
    public function getAnimesWithType()
    {
        return $this->select('animes.*, animetipe.tipeAnime, GROUP_CONCAT(DISTINCT studios.nama_studio SEPARATOR ", ") as all_studios')
                    ->join('animetipe', 'animes.typeId = animetipe.id', 'left')
                    ->join('anime_studios', 'animes.id = anime_studios.anime_id', 'left')
                    ->join('studios', 'anime_studios.studio_id = studios.id', 'left')
                    ->where('animes.statusTayang', 'published')
                    ->groupBy('animes.id')
                    ->paginate(18, 'animes');

SELECT `animes`.*, `animeTipe`.`tipeAnime`, AVG(anime_ratings.rating) as rating_user
FROM `animes`
JOIN `animetipe` ON `animes`.`typeId` = `animetipe`.`id`
LEFT JOIN `anime_ratings` ON `anime_ratings`.`anime_id` = `animes`.`id`
GROUP BY `animes`.`id`
ORDER BY RAND()
 LIMIT 5
---
    public function getRandomAnimesWithType($limit = 5)
    {
        // Ganti 'avg_rating' menjadi 'rating_user'
        return $this->select('animes.*, animeTipe.tipeAnime, AVG(anime_ratings.rating) as rating_user')
                    ->join('animetipe', 'animes.typeId = animetipe.id')
                    ->join('anime_ratings', 'anime_ratings.anime_id = animes.id', 'left')
                    ->groupBy('animes.id')
                    ->orderBy('animes.id', 'RANDOM')
                    ->limit($limit)
                    ->findAll();

SELECT `animes`.*, `animes`.`id` as `anime_id`, `animetipe`.`tipeAnime` as `tipeAnime`, GROUP_CONCAT(DISTINCT CONCAT(genre.id, ":", `genre`.`genre`, ":", genre.slug_genre) SEPARATOR ", ") AS all_genres_data, GROUP_CONCAT(DISTINCT studios.nama_studio SEPARATOR ", ") AS all_studios
FROM `animes`
LEFT JOIN `AnimeGenre` ON `animes`.`id` = `AnimeGenre`.`anime_id`
LEFT JOIN `genre` ON `AnimeGenre`.`genre_id` = `genre`.`id`
LEFT JOIN `anime_studios` ON `animes`.`id` = `anime_studios`.`anime_id`
LEFT JOIN `studios` ON `anime_studios`.`studio_id` = `studios`.`id`
LEFT JOIN `animetipe` ON `animes`.`typeId` = `animetipe`.`id`
WHERE `animes`.`slug` = 'kusuriya-no-hitorigoto'
GROUP BY `animes`.`id`
---
    public function getAnimeWithGenresSlug($slug)
    {
        $builder = $this->db->table('animes');

        // ALIASING: Paksa kolom 'id' menjadi 'anime_id'
        $builder->select('animes.*, animes.id as anime_id, animetipe.tipeAnime as tipeAnime');

        // PENTING: Gunakan SEPARATOR ',' agar explode di controller bekerja dengan baik
        $builder->select('GROUP_CONCAT(DISTINCT CONCAT(genre.id, ":", genre.genre, ":", genre.slug_genre) SEPARATOR ",") AS all_genres_data');
        $builder->select('GROUP_CONCAT(DISTINCT studios.nama_studio SEPARATOR ", ") AS all_studios');

        // SEMUA JOIN HARUS 'LEFT' AGAR DATA YANG KOSONG (NULL) TETAP DITARIK
        $builder->join('AnimeGenre', 'animes.id = AnimeGenre.anime_id', 'left');
        $builder->join('genre', 'AnimeGenre.genre_id = genre.id', 'left'); // <- Tadi salah di sini

        $builder->join('anime_studios', 'animes.id = anime_studios.anime_id', 'left');
        $builder->join('studios', 'anime_studios.studio_id = studios.id', 'left');

        $builder->join('animetipe', 'animes.typeId = animetipe.id', 'left');

        $builder->where('animes.slug', $slug);
        $builder->groupBy('animes.id');

        return $builder->get()->getRowArray();

SELECT *
FROM `animes`
JOIN `episodeanime` ON `episodeanime`.`anime_id` = `animes`.`id`
WHERE `animes`.`id` = '4'
ORDER BY `episode_number` ASC
---
    public function getEpisode($id)
    {
        return $this->db->table('animes')
                        ->join('episodeanime', 'episodeanime.anime_id = animes.id')
                        ->select('*')
                        ->where('animes.id', $id)
                        ->orderBy('episode_number', 'ASC')
                        ->get()
                        ->getResultArray();

SELECT `animes`.*
FROM `serilainnya`
JOIN `animes` ON `animes`.`id` = `serilainnya`.`seriLainnya_id`
WHERE `serilainnya`.`anime_id` = '4'
---
    public function getRelatedAnime($animeId)
    {
    return $this->db->table('serilainnya')
                    ->select('animes.*')
                    ->join('animes', 'animes.id = serilainnya.seriLainnya_id')
                    ->where('serilainnya.anime_id', $animeId)
                    ->get()
                    ->getResultArray();

SELECT `animes`.*, `animetipe`.`tipeAnime`
FROM `animes`
JOIN `animetipe` ON `animetipe`.`id` = `animes`.`typeId`
WHERE `animes`.`status` = 'On-Going'
ORDER BY `animes`.`created_at` DESC
 LIMIT 18
---
    public function getAnimesByStatus($status, $limit = 12)
    {
        return $this->select('animes.*, animetipe.tipeAnime')
                    ->join('animetipe', 'animetipe.id = animes.typeId')
                    ->where('animes.status', $status)
                    ->orderBy('animes.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT `animes`.*, `animetipe`.`tipeAnime`, IFNULL(view_data.total_sum, 0) as total_views
FROM `animes`
LEFT JOIN `animetipe` ON `animetipe`.`id` = `animes`.`typeId`
LEFT JOIN (SELECT `EpisodeAnime`.`anime_id`, SUM(episode_views.view_count) as total_sum
FROM `episode_views`
JOIN `EpisodeAnime` ON `EpisodeAnime`.`id` = `episode_views`.`episode_id`
GROUP BY `EpisodeAnime`.`anime_id`) as view_data ON `view_data`.`anime_id` = `animes`.`id`
ORDER BY `total_views` DESC
 LIMIT 10
---
    public function getPopularAnimes($limit = 10)
    {
        // 1. Buat subquery untuk menghitung total views per anime secara akurat
        $viewSubquery = $this->db->table('episode_views')
            ->select('EpisodeAnime.anime_id, SUM(episode_views.view_count) as total_sum')
            ->join('EpisodeAnime', 'EpisodeAnime.id = episode_views.episode_id')
            ->groupBy('EpisodeAnime.anime_id')
            ->getCompiledSelect();

        // 2. Gabungkan data anime dengan hasil perhitungan views tadi
        return $this->select('animes.*, animetipe.tipeAnime, IFNULL(view_data.total_sum, 0) as total_views')
                    ->join('animetipe', 'animetipe.id = animes.typeId', 'left')
                    // Join ke hasil subquery
                    ->join("($viewSubquery) as view_data", 'view_data.anime_id = animes.id', 'left')
                    ->orderBy('total_views', 'DESC')
                    ->limit($limit)
                    ->findAll();